public/redirection-and-special-files.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Redirection and Special Files</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" >
</head>
<body>
<div id="content" class="content">
<h1 class="title">Redirection and Special Files</h1>
<nav class="breadcrumbs">
<a href="/index.html">index</a> <span class="separator">/</span> <span>.</span>
</nav>
<div class="nav-buttons">
<a href="/quoting-and-execution-tracing.html" class="nav-button"><< Quoting and Execution Tracing</a>
<a href="/command-types.html" class="nav-button">>> Command Types; Command and Directory Searching</a>
</div>
<div id="table-of-contents" role="doc-toc">
<div class="toc-header" onclick="toggleToc()">
<h2>Table of Contents</h2>
<div class="toggle-icon">+</div>
</div>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org77e107a">File redirection</a></li>
<li><a href="#orgf91b9f7">Pipelines</a></li>
<li><a href="#orgb29967f">Redirecting <code>stderr</code> vs <code>stdout</code></a></li>
<li><a href="#orga8fffcc">Here documents</a></li>
<li><a href="#orgd3381b8">Special files</a>
<ul>
<li><a href="#org715b16f"><code>/dev/null</code></a></li>
<li><a href="#orgb71d86e"><code>/dev/tty</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org77e107a" class="outline-2">
<h2 id="org77e107a">File redirection</h2>
<div class="outline-text-2" id="text-org77e107a">
<ul class="org-ul">
<li><code>&lt;</code> redirects stdin</li>
<li><code>&gt;</code> redirects stdout</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">redirecting output
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"oiee"</span> &gt; oiee.txt

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">redirecting input
</span>cat &lt; oiee.txt
</pre>
</div>

<pre class="example">
oiee
</pre>


<p>
We can copy files using cat lol:
</p>
<div class="org-src-container">
<pre class="src src-bash">cat &lt; oiee.txt &gt; oiee2.txt

cat oiee2.txt
</pre>
</div>

<pre class="example">
oiee
</pre>


<ul class="org-ul">
<li><code>&gt;&gt;</code> appends to the output file!</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">cp oiee.txt test1.txt
cat test1.txt

<span style="font-weight: bold;">echo</span> one line &gt; test1.txt
cat test1.txt

<span style="font-weight: bold;">echo</span> another line &gt;&gt; test1.txt
cat test1
</pre>
</div>

<pre class="example">
oiee
one line
one line
another line
</pre>
</div>
</div>
<div id="outline-container-orgf91b9f7" class="outline-2">
<h2 id="orgf91b9f7">Pipelines</h2>
<div class="outline-text-2" id="text-orgf91b9f7">
<p>
They hook 2 files together.
</p>

<div class="org-src-container">
<pre class="src src-bash">ls

<span style="font-weight: bold;">echo</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">tac reverts its input
</span>ls | tac
</pre>
</div>

<pre class="example" id="org5d0c611">
arguments.org
index.org
index.org~
intro.org
oiee2.txt
oiee.txt
quoting-and-execution-tracing.org
redirection-and-special-files.org
scripts
shell-expansions.org
test1.txt
text1.txt
variables-and-simple-output.org

variables-and-simple-output.org
text1.txt
test1.txt
shell-expansions.org
scripts
redirection-and-special-files.org
quoting-and-execution-tracing.org
oiee.txt
oiee2.txt
intro.org
index.org~
index.org
arguments.org
</pre>

<ul class="org-ul">
<li><b>try not using <code>cat</code> as the first command</b> because most commands accept a file as input</li>
</ul>
</div>
</div>
<div id="outline-container-orgb29967f" class="outline-2">
<h2 id="orgb29967f">Redirecting <code>stderr</code> vs <code>stdout</code></h2>
<div class="outline-text-2" id="text-orgb29967f">
<ul class="org-ul">
<li>We can redirect <code>stderr</code> to other files with <code>2&gt;</code>:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;">
</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"This goes to stdout (normal output)"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"This also goes to stdout"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"This goes to stderr (error output)"</span> &gt;&amp;2
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"More stdout output"</span>
ls /nonexistent-directory  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This will generate stderr
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Final stdout message"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/error-and-output 2&gt; errors.txt
</pre>
</div>

<pre class="example">
This goes to stdout (normal output)
This also goes to stdout
More stdout output
Final stdout message
</pre>



<div class="org-src-container">
<pre class="src src-bash">cat errors.txt
</pre>
</div>

<pre class="example">
bash: line 1: ./scripts/error-and-output: No such file or directory
</pre>


<ul class="org-ul">
<li>we can combine <code>stderr</code> and <code>stdout</code> with <code>2&gt;&amp;1</code>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">send stderr to stdout, tee to save to file and print
</span>./scripts/error-and-output.sh 2&gt;&amp;1 | tee errors <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">tee is "pipe fitting"
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">just save to a file to see later
</span>./scripts/error-and-output.sh &gt; output.txt 2&gt;&amp;1 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">this order is important!</span>
</pre>
</div>

<p>
We should:
</p>
<ul class="org-ul">
<li>capture <code>stderr</code> when it's appropriate</li>
<li>throw ouput away if we dont need it (or save for later)</li>
</ul>
</div>
</div>
<div id="outline-container-orga8fffcc" class="outline-2">
<h2 id="orga8fffcc">Here documents</h2>
<div class="outline-text-2" id="text-orga8fffcc">
<p>
<code>&lt;&lt;</code> is called a "here document".
</p>

<p>
You type a command, then <code>&lt;&lt;</code> then a marker. The shell gathers everything after the marker until it sees another instance of it and provides that as <code>stdin</code> to the command
</p>

<p>
<b>We can use these instead of separate data files!</b>
</p>

<div class="org-src-container">
<pre class="src src-bash">cat &lt;&lt; EOF<span style="font-weight: bold;">
Line 1
Line 2
Here is my home dir $HOME
EOF</span>
</pre>
</div>

<pre class="example">
Line 1
Line 2
Here is my home dir /home/nasreddin
</pre>


<p>
<b>OBS</b>: if you quote the marker then the shell doesn't process it
</p>

<ul class="org-ul">
<li>We use <code>&lt;&lt;-</code> if we want to use here documents inside a shell script file and want to allow the text of the here document to be intented with <b>tabs</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">cat &lt;&lt; EOF<span style="font-weight: bold;">
This is a here document
        This line has a tab at the start
                This line has two tabs
        Back to one tab
No tabs here
EOF
</span>
<span style="font-weight: bold;">echo</span>

cat &lt;&lt;- EOF<span style="font-weight: bold;">
        This is a here document with &lt;&lt;-
                This line had a tab at the start (now stripped)
                        This line had two tabs (now stripped)
                Back to one tab (now stripped)
        No leading content, just a tab (stripped)
EOF</span>
</pre>
</div>

<pre class="example" id="org6fa52ab">
This is a here document
	This line has a tab at the start
		This line has two tabs
	Back to one tab
No tabs here

This is a here document with &lt;&lt;-
This line had a tab at the start (now stripped)
This line had two tabs (now stripped)
Back to one tab (now stripped)
No leading content, just a tab (stripped)
</pre>
</div>
</div>
<div id="outline-container-orgd3381b8" class="outline-2">
<h2 id="orgd3381b8">Special files</h2>
<div class="outline-text-2" id="text-orgd3381b8">
</div>
<div id="outline-container-org715b16f" class="outline-3">
<h3 id="org715b16f"><code>/dev/null</code></h3>
<div class="outline-text-3" id="text-org715b16f">
<p>
The <b>bit bucket</b>. Output to <code>/dev/null</code> is thrown away!
</p>

<p>
Useful in cases where we dont care about the output but want exit status or other thing.
</p>
</div>
</div>
<div id="outline-container-orgb71d86e" class="outline-3">
<h3 id="orgb71d86e"><code>/dev/tty</code></h3>
<div class="outline-text-3" id="text-orgb71d86e">
<p>
This is our terminal! ("tty" stands for "teletype")
</p>

<p>
Important if we wish to communicate with the user. <code>stdout</code>, <code>stdin</code> and <code>stderr</code> can be redirected but with <code>/dev/tty</code> <b>we are working with the users terminal</b>!
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">sh</span><span style="font-weight: bold; font-style: italic;"> -
</span>
<span style="font-weight: bold; font-style: italic;">pass</span>=x <span style="font-weight: bold; font-style: italic;">pass2</span>=y
<span style="font-weight: bold;">until</span> [ <span style="font-style: italic;">"$pass"</span> = <span style="font-style: italic;">"$pass2"</span> ]; <span style="font-weight: bold;">do</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">turn off echoing
</span>    stty -echo

    printf <span style="font-style: italic;">"Enter new password: "</span>

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">read password from tty
</span>    <span style="font-weight: bold;">read</span> pass &lt; /dev/tty

    printf <span style="font-style: italic;">"\nEnter again: "</span>

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">read password2 from tty
</span>    <span style="font-weight: bold;">read</span> pass2 &lt; /dev/tty

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">turn echoing back on
</span>    stty echo

    <span style="font-weight: bold;">echo</span>

    <span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"$pass"</span> = <span style="font-style: italic;">"$pass2"</span> ]; <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold;">echo</span> Passwords match
    <span style="font-weight: bold;">else</span>
        <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Passwords don\'t match"</span>
    <span style="font-weight: bold;">fi</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/redirection-prompting.sh
</pre>
</div>

<pre class="example" id="orgce5cba5">
Enter new password:
Enter again:
Passwords match
</pre>

<p>
We cant see our passwords!
</p>
</div>
</div>
</div>
</div>

<div class="footer">
<nav class="breadcrumbs footer">
<a href="/index.html">index</a> <span class="separator">/</span> <span>.</span>
</nav>
<div class="nav-buttons">
<a href="/quoting-and-execution-tracing.html" class="nav-button"><< Quoting and Execution Tracing</a>
<a href="/command-types.html" class="nav-button">>> Command Types; Command and Directory Searching</a>
</div>
</div>
</body>
</html>
